#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/heder24/juicebox/runs/run-NXhoYW5THAjCT2xx

Waiting for the plan to start...

Terraform v1.6.3
on linux_amd64
Initializing plugins and modules...
module.base-ec2-role.data.aws_partition.current: Refreshing...
module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Refreshing...
data.aws_ami.ubuntu: Refreshing...
data.aws_route53_zone.heder_lab_zone: Refreshing...
data.aws_availability_zones.available: Refreshing...
module.base-ec2-role.data.aws_caller_identity.current: Refreshing...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0cfa14d24259ef964]
module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Refreshing...
module.prod_asg.data.aws_default_tags.current: Refreshing...
module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Refresh complete after 0s [id=2053943846]
data.aws_eip.bastion_eip: Refreshing...
module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Refresh complete after 0s [id=1021377347]
module.prod_asg.data.aws_partition.current: Refreshing...
module.prod_bastion.data.aws_partition.current: Refreshing...
module.base-ec2-role.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.prod_asg.data.aws_default_tags.current: Refresh complete after 0s [id=aws]
module.prod_asg.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.prod_bastion.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=arn:aws:iam::312029113425:policy/vpc-flow-log-to-cloudwatch-20231106033406356400000001]
module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20231106033406356900000002]
module.base-ec2-role.data.aws_caller_identity.current: Refresh complete after 0s [id=312029113425]
module.base-ec2-role.data.aws_iam_policy_document.assume_role[0]: Refreshing...
module.base-ec2-role.data.aws_iam_policy_document.assume_role[0]: Refresh complete after 0s [id=3095392050]
module.base-ec2-role.aws_iam_role.this[0]: Refreshing state... [id=base-ec2-role-1]
data.aws_availability_zones.available: Refresh complete after 0s [id=us-east-2]
data.aws_eip.bastion_eip: Refresh complete after 0s [id=eipalloc-003f1118979070f7a]
module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20231106033406356900000002-20231106033406618200000005]
module.base-ec2-role.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=base-ec2-role-1-20231106033406581500000004]
module.base-ec2-role.aws_iam_role_policy_attachment.custom[1]: Refreshing state... [id=base-ec2-role-1-20231106033406563500000003]
module.base-ec2-role.aws_iam_instance_profile.this[0]: Refreshing state... [id=base-ec2-role-1]
data.aws_ami.ubuntu: Refresh complete after 0s [id=ami-073e5edf4b5d15fc8]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-082ca85469ddd41db]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0a869a09045b2a72d]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-03dae4967867698e4]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0b78443bd6fc3358f]
module.public_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0eabf6f6a0343fe2d]
module.alb.aws_security_group.this[0]: Refreshing state... [id=sg-04db19c0350d66748]
module.vpc.aws_cloudwatch_log_group.flow_log[0]: Refreshing state... [id=/aws/vpc-flow-log/vpc-0cfa14d24259ef964]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-06e67182c64f3e7f9]
module.private_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-044ba3e7969d7d880]
module.alb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:312029113425:targetgroup/prod2023110603341809350000000a/2cdfd9bb6a8f8c16]
module.bastion_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-02d6937ed608741eb]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-02b00abfa93d1f708]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0baa0034b5f6b9893]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-076538a0c413498c1]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0fa766c96799643c7]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-01481fb36398fd6c3]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-053d03a076f6c7c7b]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0eeadb9cf542b69d9]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-00cd2bef98eba042f]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-03dae4967867698e41080289494]
module.public_sg.aws_security_group_rule.egress_with_ipv6_cidr_blocks[1]: Refreshing state... [id=sgrule-3416127145]
module.public_sg.aws_security_group_rule.egress_with_cidr_blocks[1]: Refreshing state... [id=sgrule-1675154621]
module.public_sg.aws_security_group_rule.egress_with_ipv6_cidr_blocks[0]: Refreshing state... [id=sgrule-1325253938]
module.public_sg.aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-699609821]
module.public_sg.aws_security_group_rule.ingress_with_ipv6_cidr_blocks[0]: Refreshing state... [id=sgrule-418312446]
module.public_sg.aws_security_group_rule.ingress_with_ipv6_cidr_blocks[1]: Refreshing state... [id=sgrule-2142689793]
module.vpc.aws_flow_log.this[0]: Refreshing state... [id=fl-0933dbbac74fe4c86]
module.public_sg.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-2051620367]
module.public_sg.aws_security_group_rule.ingress_with_cidr_blocks[1]: Refreshing state... [id=sgrule-934360241]
data.aws_route53_zone.heder_lab_zone: Refresh complete after 1s [id=Z10479661QT4EPRK5O3JF]
module.bastion_sg.aws_security_group_rule.ingress_with_ipv6_cidr_blocks[0]: Refreshing state... [id=sgrule-3705648520]
module.bastion_sg.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-707665538]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0413c1f40d2afbdb7]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-03f5e24cee8307c86]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0a406fcb059b25138]
module.private_sg.aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3484454557]
module.private_sg.aws_security_group_rule.egress_with_ipv6_cidr_blocks[0]: Refreshing state... [id=sgrule-1952923032]
module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:312029113425:loadbalancer/app/prod/5b00ce5b987c65ae]
module.prod_bastion.aws_instance.this[0]: Refreshing state... [id=i-0f59eb0ebc5f5bb28]
module.private_sg.aws_security_group_rule.computed_ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-1707605582]
module.private_sg.aws_security_group_rule.computed_ingress_with_source_security_group_id[1]: Refreshing state... [id=sgrule-2821117759]
module.private_sg.aws_security_group_rule.computed_ingress_with_source_security_group_id[2]: Refreshing state... [id=sgrule-2496813885]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0229611195c7bdd51]
module.bastion_sg.aws_security_group_rule.computed_egress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-922371869]
module.prod_asg.aws_launch_template.this[0]: Refreshing state... [id=lt-0a981398e5fdc76fc]
module.dns_records.data.aws_route53_zone.this[0]: Refreshing...
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-06e67182c64f3e7f91080289494]
aws_eip_association.eip_assoc: Refreshing state... [id=eipassoc-012f06d6b9e14e3f8]
module.prod_asg.aws_autoscaling_group.idc[0]: Refreshing state... [id=prod]
module.dns_records.data.aws_route53_zone.this[0]: Refresh complete after 0s [id=Z10479661QT4EPRK5O3JF]
module.dns_records.aws_route53_record.this["www.hederdevops.com A"]: Refreshing state... [id=Z10479661QT4EPRK5O3JF_www.hederdevops.com_A]
module.dns_records.aws_route53_record.this["www.stage.hederdevops.com A"]: Refreshing state... [id=Z10479661QT4EPRK5O3JF_www.stage.hederdevops.com_A]
module.dns_records.aws_route53_record.this["www.qa.hederdevops.com A"]: Refreshing state... [id=Z10479661QT4EPRK5O3JF_www.qa.hederdevops.com_A]
module.bastion_sg.aws_security_group.this_name_prefix[0]: Drift detected (update)
module.base-ec2-role.aws_iam_instance_profile.this[0]: Drift detected (update)
module.base-ec2-role.aws_iam_role.this[0]: Drift detected (update)
aws_eip_association.eip_assoc: Drift detected (delete)
module.prod_asg.aws_autoscaling_group.idc[0]: Drift detected (delete)
module.prod_asg.aws_launch_template.this[0]: Drift detected (update)
module.public_sg.aws_security_group.this_name_prefix[0]: Drift detected (update)
module.public_sg.aws_security_group_rule.egress_with_cidr_blocks[0]: Drift detected (update)
module.public_sg.aws_security_group_rule.egress_with_cidr_blocks[1]: Drift detected (update)
module.vpc.aws_route_table.private[0]: Drift detected (update)
module.vpc.aws_nat_gateway.this[0]: Drift detected (delete)
module.vpc.aws_route.private_nat_gateway[0]: Drift detected (update)
module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0]: Drift detected (update)
module.vpc.aws_route_table.public[0]: Drift detected (update)
module.private_sg.aws_security_group.this_name_prefix[0]: Drift detected (update)
module.dns_records.aws_route53_record.this["www.hederdevops.com A"]: Drift detected (update)
module.dns_records.aws_route53_record.this["www.qa.hederdevops.com A"]: Drift detected (update)
module.dns_records.aws_route53_record.this["www.stage.hederdevops.com A"]: Drift detected (update)
module.prod_bastion.aws_instance.this[0]: Drift detected (delete)

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.prod_asg.aws_autoscaling_group.idc[0] has been deleted
  - resource "aws_autoscaling_group" "idc" {
      - arn                              = "arn:aws:autoscaling:us-east-2:312029113425:autoScalingGroup:088f2ee5-23a7-497e-9250-73e4274760fa:autoScalingGroupName/prod" -> null
      - availability_zones               = [
          - "us-east-2a",
          - "us-east-2b",
          - "us-east-2c",
        ] -> null
      - default_cooldown                 = 300 -> null
      - desired_capacity                 = 2 -> null
      - health_check_grace_period        = 300 -> null
      - health_check_type                = "EC2" -> null
      - id                               = "prod" -> null
      - load_balancers                   = [] -> null
      - max_size                         = 3 -> null
      - min_size                         = 1 -> null
      - name                             = "prod" -> null
      - target_group_arns                = [
          - "arn:aws:elasticloadbalancing:us-east-2:312029113425:targetgroup/prod2023110603341809350000000a/2cdfd9bb6a8f8c16",
        ] -> null
      - vpc_zone_identifier              = [
          - "subnet-076538a0c413498c1",
          - "subnet-0baa0034b5f6b9893",
          - "subnet-0fa766c96799643c7",
        ] -> null
        # (13 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.prod_bastion.aws_instance.this[0] has been deleted
  - resource "aws_instance" "this" {
      - ami                                  = "ami-073e5edf4b5d15fc8" -> null
      - arn                                  = "arn:aws:ec2:us-east-2:312029113425:instance/i-0f59eb0ebc5f5bb28" -> null
      - availability_zone                    = "us-east-2a" -> null
      - id                                   = "i-0f59eb0ebc5f5bb28" -> null
      - instance_state                       = "running" -> null
      - ipv6_addresses                       = [] -> null
      - primary_network_interface_id         = "eni-0463edf40adf08d19" -> null
      - private_dns                          = "ip-10-70-4-220.us-east-2.compute.internal" -> null
      - private_ip                           = "10.70.4.220" -> null
      - public_dns                           = "ec2-3-15-211-247.us-east-2.compute.amazonaws.com" -> null
      - public_ip                            = "3.15.211.247" -> null
        tags                                 = {
            "Name" = "prod-bastion"
        }
      - tags_all                             = {
          - "Name" = "prod-bastion"
        } -> null
        # (23 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0690f4f74252fb5a4" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }

        # (7 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_eip_association.eip_assoc will be created
  + resource "aws_eip_association" "eip_assoc" {
      + allocation_id        = "eipalloc-003f1118979070f7a"
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip_address   = (known after apply)
      + public_ip            = (known after apply)
    }

  # module.alb.aws_lb_listener.frontend_http_tcp[0] will be created
  + resource "aws_lb_listener" "frontend_http_tcp" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-2:312029113425:loadbalancer/app/prod/5b00ce5b987c65ae"
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "MyLoadBalancerTCPListener" = "prod-listener"
        }
      + tags_all          = {
          + "MyLoadBalancerTCPListener" = "prod-listener"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:312029113425:targetgroup/prod2023110603341809350000000a/2cdfd9bb6a8f8c16"
          + type             = "forward"
        }
    }

  # module.prod_asg.aws_autoscaling_group.idc[0] will be created
  + resource "aws_autoscaling_group" "idc" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + default_instance_warmup          = 300
      + desired_capacity                 = 2
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "EC2"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 3
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = "prod"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = [
          + "arn:aws:elasticloadbalancing:us-east-2:312029113425:targetgroup/prod2023110603341809350000000a/2cdfd9bb6a8f8c16",
        ]
      + termination_policies             = []
      + vpc_zone_identifier              = [
          + "subnet-076538a0c413498c1",
          + "subnet-0baa0034b5f6b9893",
          + "subnet-0fa766c96799643c7",
        ]
      + wait_for_capacity_timeout        = "0"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = "unknown"
          + name    = "lt-prod-2023110603342110900000000e"
          + version = "1"
        }

      + tag {
          + key                 = "GithubOrg"
          + propagate_at_launch = true
          + value               = "hederdevops"
        }
      + tag {
          + key                 = "GithubRepo"
          + propagate_at_launch = true
          + value               = "heder-class-devops"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "prod-web"
        }

      + timeouts {}
    }

  # module.prod_bastion.aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-073e5edf4b5d15fc8"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = "us-east-2a"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = false
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "base-ec2-role-1"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "main-us-east-2"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0a869a09045b2a72d"
      + tags                                 = {
          + "Name" = "prod-bastion"
        }
      + tags_all                             = {
          + "Name" = "prod-bastion"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = true
      + volume_tags                          = {
          + "Name" = "prod-bastion"
        }
      + vpc_security_group_ids               = [
          + "sg-02d6937ed608741eb",
        ]

      + credit_specification {}

      + enclave_options {
          + enabled = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = (known after apply)
        }

      + timeouts {}
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = "eipalloc-00cd2bef98eba042f"
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = "subnet-0a869a09045b2a72d"
      + tags                               = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
      + tags_all                           = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be updated in-place
  ~ resource "aws_route" "private_nat_gateway" {
        id                     = "r-rtb-06e67182c64f3e7f91080289494"
      ~ nat_gateway_id         = "nat-0229611195c7bdd51" -> (known after apply)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 5 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ ec2_id                                      = "i-0f59eb0ebc5f5bb28" -> (known after apply)
  ~ natgw_ids                                   = [
      - "nat-0229611195c7bdd51",
      + (known after apply),
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @heder24, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*